MYSQL_HOST = '222.186.173.204'
MYSQL_PORT = 3306
MYSQL_USER = 'alex1943_read_books'
MYSQL_PASSWORD = 'QWEqwe123!@#'
MYSQL_DATABASE = 'books'

BOOK_LIST = [
    'xuanhuan',
    'xiuzhen',
    'dushi',
    'lishi',
    'wangyou',
    'kehuan',
    'yanqing',
    'qita',
    'quanben'
]

BOOK_CATES = [
            {"id":0, "text": '首页', "url":'/index'},
            {"id":1, "text": '玄幻', "url":'/xuanhuan'},
            {"id":2, "text": '修真', "url":'/xiuzhen'},
            {"id":3, "text": '都市', "url":'/dushi'},
            {"id":4, "text": '历史', "url":'/lishi'},
            {"id":5, "text": '网游', "url":'/wangyou'},
            {"id":6, "text": '科幻', "url":'/kehuan'},
            {"id":7, "text": '言情', "url":'/yanqing'},
            {"id":8, "text": '其他', "url":'/qita'},
            {"id":9, "text": '完本', "url":'/quanben'},
]

TITLES = {
        "/":[
                    '明月书吧_书友最值得收藏的网络小说阅读网站',
                    '明月书吧,无弹窗,小说阅读网,mingyueshuba',
                    '明月书吧是广大书友最值得收藏的网络小说阅读网，网站收录了当前最火热的网络小说，免费提供高质量的小>说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/index":[
                    '明月书吧_书友最值得收藏的网络小说阅读网站',
                    '明月书吧,无弹窗,小说阅读网,mingyueshuba',
                    '明月书吧是广大书友最值得收藏的网络小说阅读网，网站收录了当前最火热的网络小说，免费提供高质量的小>说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/xiuzhen":[
                    '修真_好看的修真_小说_明月书吧',
                    '明月书吧,修真,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    "明月书吧是广大书友最值得收藏的修真阅读网，网站收录了当前最火热的修真，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。"
        ],
        "/xuanhuan":[
                    '玄幻_好看的玄幻_明月书吧',
                    '明月书吧,玄幻,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的玄幻阅读网，网站收录了当前最火热的玄幻，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/dushi":[
                    '都市_好看的都市_小说_明月书吧',
                    '明月书吧,都市,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的都市阅读网，网站收录了当前最火热的都市，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/lishi":[
                    '历史_好看的历史_小说_明月书吧',
                    '明月书吧,历史,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的历史阅读网，网站收录了当前最火热的历史，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/wangyou":[
                    '网游_好看的网游_小说_明月书吧',
                    '明月书吧,网游,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的网游阅读网，网站收录了当前最火热的网游，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'],
        "/kehuan":[
                    '科幻_好看的科幻_小说_明月书吧',
                    '明月书吧,科幻,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的科幻阅读网，网站收录了当前最火热的科幻，免费提供高质量的小说最>新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/yanqing":[
                    '言情_好看的言情_小说_明月书吧',
                    '明月书吧,言情,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的言情阅读网，网站收录了当前最火热的言情，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/qita":[
                    '其他_好看的其他_小说_明月书吧',
                    '明月书吧,其他,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的其他阅读网，网站收录了当前最火热的其他，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "/quanben":[
                    '完结_完本_好看的完结_好看的完本_明月书吧',
                    '明月书吧,完本,完结,小说阅读网,无弹窗小说,小说，mingyueshuba',
                    '明月书吧是广大书友最值得收藏的完结阅读网，网站收录了当前最火热的完结，免费提供高质量的小说最新章节，是广大网络小说爱好者必备的小说阅读网。'
        ],
        "bookindex":[
                    '在线阅读_明月书吧',
                    '风华绝代的alexhunter_bookindex_关键词',
                    '明月书吧提供'
        ],
        "bookdetail":[
                    ' - 明月书吧',
                    ',无弹窗阅读.',
                    '，本站提供无弹窗阅读环境.'
        ]
}
